Revit 2027 API
BuiltInFailures.SiteFailures.SiteMergeDisconnected Property
 The two surfaces you are trying to merge are disconnected from one another. They should overlap, or at least share edges.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SiteMergeDisconnected { get; }
Public Shared ReadOnly Property SiteMergeDisconnected As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SiteMergeDisconnected {
	FailureDefinitionId^ get ();
}
static member SiteMergeDisconnected : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace